app/controllers/elects_controller.rb

  def index
    @elects = Elect.all
---
SELECT "elects".* FROM "elects"

  def create
    @elect = Elect.new(elect_params)

    respond_to do |format|
      if @elect.save
---
INSERT INTO "elects" ("name", "facts", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Governor"], ["facts", "Runs state"], ["created_at", "2022-06-26 18:06:03.757947"], ["updated_at", "2022-06-26 18:06:03.757947"]]

    def set_elect
      @elect = Elect.find(params[:id])
---
SELECT "elects".* FROM "elects" WHERE "elects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]